[
  
    {
      "title"    : "Something no one tells you about minifying AngularJS controllers (until it&#39;s too late)",
      "category" : "javascript angularjs",
      "content"	 : "This post is going to talk briefly about the common ways people are shown to write AngularJS controllers, why minifying your code will break your application if you write them in this way, and how to fix this problem.The usual approach to writing controllersIn many online AngularJS tutorials, you’re taught (for simplicity’s sake) to write a controller as such:var app = angular.module(&amp;#39;myModule&amp;#39;);app.controller(&amp;#39;MyController&amp;#39;,function($scope) {$scope.doSomething = function() {// some code here}});The above code has several advantages. First, it’s simple to read. Second, it’s simple to write. However, it is generally recommended to minify your JavaScript code before deploying it live, since this reduces the size of the file that the server has to send (in other words, this can dramatically increase the user’s perception of how fast your application loads).Minifying the above controller will break your application. Here’s why…Quick little tangent: if you’re curious, I use Gulp to concatenate and minify my project files. If you’re just writing some code in JSBin, for example, you can just head over to an online minifier like jscompress, which will do the job just fine in most cases.Continuing on… if you minify our above example and open your app, you’ll see that nothing happens. And you’ll get this error in your console:Error: [$injector:unpr]So what is this error? If we click on the error in our console, it will take us to the AngularJS website, which will say something like this:  This error results from the $injector being unable to resolve a required dependency. To fix this, make sure the dependency is defined and spelled correctly.In other words, because of the way AngularJS uses dependency injection (it actually parses the arguments of your functions), when the code is minified, $scope is no longer $scope, $route is no longer $route, etc. Instead, they’re just minified variables, like e or a, which don’t make any sense to AngularJS (if you want to understand a little bit more about dependency injection and how it works in JavaScript, check out these two posts: one by Anand and one by Alex. For now, just know that minfiying breaks dependency injection.)In fact, I’ve written two JSBin examples for you to see what exactly is going on.Working exampleJS BinNon-working (minified) exampleJS BinOpen up your console (if you’re on Mac with Chrome, hit CMD+opt+j), and you’ll actually see the injector error live on this site (since I embedded the JSBin).How to fix itWhen you click on your error message in the console, which leads to the AngularJS website, they actually provide you with a solution to this error:angular.module(&amp;#39;myApp&amp;#39;, []).controller(&amp;#39;MyController&amp;#39;, [&amp;#39;myService&amp;#39;, function (myService) {  // Do something with myService}]);This way works completely fine. If you minify, AngularJS instead looks at each item in the array (which is the second argument passed to the controller in the above example), and resolves any minified dependency to match its correct string name.But as you may or may not know, I am a big fan of John Papa’s Style Guide, and he specifically recommends against the above example, for several reasons. However, the biggest reason to me, is that with a long list of dependencies, the above code can get very hard to read, very quickly.Just imagine if we have something like this:angular.module(&amp;#39;myApp&amp;#39;, []).controller(&amp;#39;MyController&amp;#39;, [&amp;#39;$scope&amp;#39;, &amp;#39;$route&amp;#39;, &amp;#39;Item&amp;#39;, &amp;#39;items&amp;#39;, &amp;#39;utils&amp;#39;, &amp;#39;shade&amp;#39;, function ($scope,$route,Item,items,utils,shade) {  // Do something}]);Okay, okay, it’s not terrible. But I think there’s a better way to write it. As John Papa says:  Why?: Avoid creating in-line dependencies as long lists can be difficult to read in the array. Also it can be confusing that the array is a series of strings while the last item is the component’s function.Use $inject:angular.module(&amp;#39;myApp&amp;#39;, []);MyController.$inject = [&amp;#39;$scope&amp;#39;, &amp;#39;$route&amp;#39;, &amp;#39;Item&amp;#39;, &amp;#39;items&amp;#39;, &amp;#39;utils&amp;#39;, &amp;#39;shade&amp;#39;];angular.module(&amp;#39;myApp&amp;#39;).controller(&amp;#39;MyController&amp;#39;, MyController);function MyController($scope,$route,Item,items,utils,shade) {// do something}The above makes me breathe a sigh of relief, due to the now ease of readability. And, we’ve solved our issue of minification. We are now minification-safe! Anyone looking at the code can now understand exactly what is happening. “Oh, okay, so we have injected several services into this controller…”You’ll notice too that I separated the declarations of the module (I didn’t chain .controller to angular.module(&#39;myApp&#39;,[])). Once again, I recommend reading John Papa’s style guide for quick clarification on that.ConclusionThis doesn’t just go for controllers. It goes for anything where you inject anything. Directives, configs, runs, factories, etc. I am of the opinion that following the above implementation of dependency injection, at least in the current version of AngularJS at the time of writing this (end of March 2015), is probably one of the best solutions to solving the minification and readibility issues caused by other solutions.So to recap what we learned… Minifying code that uses string-dependent dependency injection can break your application, unless you explicitly define the strings to use for the dependencies, which $inject is perfect for.",
      "url"      : "/javascript/angularjs/2015/03/31/something-no-one-tells-you-about-minifying-angularjs-controllers-until-its-too-late.html",
      "date"     : "2015-03-31 05:48:00 -0500"
    },
  
    {
      "title"    : "Getting started with a search engine for your site (no server required!)",
      "category" : "javascript jekyll tutorial",
      "content"	 : "Today we&#39;ll talk about how to build a JavaScript-only search engine (using JSON and AJAX) to avoid databases and server-side programming. We&#39;ll do it all specifically in the context of Jekyll and GitHub Pages!What do you mean “no server”?Lots of search features on websites rely on communicating with the server to deliver search results. For example, a user might click a search button that sends, say, a POST request to the server, where a .php file handles the request, and sends the results back.With the way we’re gonna do it here, we’re going to handle the request entirely on the client. No server-side code processing required. We’ll go over the architecture in a minute.Why not process on the server?Nothing wrong with the traditional way of doing it. For my website, though, I’m using Jekyll, and I’m hosting it on GitHub pages. GitHub pages doesn’t support processing with PHP, Node.js, etc. Therefore, the only way to do it is on the client (with a little bit of pre-processing, which we’ll go over in a second).TutorialTechnologies used  Jekyll (a static site generator)  lunr.js (a JavaScript search indexer)  jQuery (to make the AJAX stuff and displaying the results easier)Architecture  Take advantage of Liquid (the template system that Jekyll uses) to create a JSON file of all our searchable content (in this example, blog posts)  Write some JavaScript that sends an AJAX request to retrieve the JSON file whenever the user searches for something  Use lunr.js to match the search query against all the blog posts in the JSON file and display the search results in order by the strength of the match&amp;hellip;Step 1 — Make the JSON fileWe’re going to kind of “hack” our way through Liquid to create a JSON file.Create a new file in your root called posts.json. Open it up:------[  {% for post in site.posts %}    {      &amp;quot;title&amp;quot;    : &amp;quot;{{ post.title | escape }}&amp;quot;,      &amp;quot;category&amp;quot; : &amp;quot;{{ post.categories | join: &amp;#39; &amp;#39; }}&amp;quot;,      &amp;quot;content&amp;quot; : &amp;quot;{{post.content | strip_html | strip_newlines | remove:  &amp;quot;&amp;quot; | escape | remove: &amp;quot;&amp;quot;}}&amp;quot;,      &amp;quot;url&amp;quot;      : &amp;quot;{{ site.baseurl }}{{ post.url }}&amp;quot;,      &amp;quot;date&amp;quot;     : &amp;quot;{{ post.date }}&amp;quot;    }{% unless forloop.last %},{% endunless %}  {% endfor %}]You’ll notice some strange things. First, if you’re using syntax highlighting, you’ll get all kinds of weird “errors”. Ignore them. JSON or JavaScript syntax highlighting doesn’t understand that we’re using Liquid.Second, how the hell is this going to work, if it’s a JSON file? Well, you see the two sets of --- at the top of the file? When you run jekyll build, it will see this file as a “special file” that needs to be processed with Liquid. If we remove the ---, it won’t process the template. This is called “YAML front matter”. Any pages with YAML front matter get processed with Liquid.Most of the templating above is self-explanatory if you understand the basics of Liquid filters. However there is one line I’d like to explain.&amp;quot;content&amp;quot;   : &amp;quot;{{post.content | strip_html | strip_newlines | remove:  &amp;quot;&amp;quot; | escape | remove: &amp;quot;&amp;quot;}}&amp;quot;,The content of our post might contain raw tab characters, as well as double quotes (&quot;). Well, as it turns out, having tab characters inside a JSON string is invalid JSON, so when we call our AJAX request later, nothing would be returned! Not good.Solution? Run two remove filters: one for the tab character, and one for the double quotes.Also, I want to explain this part:}{% unless forloop.last %},{% endunless %}If you don’t have that line of code, your output would look something like this:[{ /* content */ },{ /* content */ },{ /* content */ },]See the trailing comma on the last object? This is also invalid JSON. Not good. So, we run a some Liquid that says don’t put a comma at the end if it’s the last object.Now, run jekyll build, and you’ll end up with a compiled posts.json underneath _site, which contains the entire built site. Here’s the compiled JSON:[    {      &amp;quot;title&amp;quot;    : &amp;quot;Why do people add semicolons before modules?&amp;quot;,      &amp;quot;category&amp;quot; : &amp;quot;javascript snippet&amp;quot;,      &amp;quot;content&amp;quot; : &amp;quot;Simple answer: because of minification issues.Minification can cause modules to use each other as their arguments (unintentionally), if the developer isn’t careful.(function() {// code})()(function() {// code})();If you look closely enough at the above, you’ll see the first IIFE is missing a semicolon at the end.That means that when minified, it’ll look like this:The broken code:(function() {})()(function() {})();// (a)()(b)()The problem is that now function a is being called with function b passed in as an argument. Interesting.So, we just add a ; to the beginning of the module, and to the end. This acts as a safeguard to ensure we don’t run into that problem when we minify.So, when we try doing the above example with semicolons at the beginning and at the end, and you minify the code, you get this instead:The working code:;(function() {})();;(function() {})();The cool thing is, the above doesn’t throw any errors. In fact, JSHint won’t yell at you either.Why is this? Check out the MDN article on empty:  An empty statement is used to provide no statement, although the JavaScript syntax would expect one.So those extra semicolons are not a syntax error, because a random semicolon anywhere in the code can be interpreted as an empty statement. Cool, huh?&amp;quot;,      &amp;quot;url&amp;quot;      : &amp;quot;/javascript/snippet/2015/03/22/why-do-people-add-semicolons-before-modules.html&amp;quot;,      &amp;quot;date&amp;quot;     : &amp;quot;2015-03-22 18:34:00 -0500&amp;quot;    },    /* and several other posts*/]I strongly recommend running your output through JSONLint if your code isn&#39;t working right. It&#39;ll help you find whatever errors you might have in your JSON syntax.Step 2 — Send an AJAX requestCreate a “Query” objectDon’t confuse our Query object with jQuery. Our Query object will serve as a container for everything related to our search. I’ve commented the code so you can see what everything does.//Create a module using an IIFE;(function(global,$) {  /*    Put ourselves into &amp;quot;strict&amp;quot; mode    This just helps us write cleaner JavaScript  */  &amp;#39;use strict&amp;#39;;  Query.prototype = {    // this.q is our search query (for example, &amp;quot;javascript tutorial&amp;quot;)    set: function(val) {      this.q = val;      return this;    },    // brings us to our search page with a query string attached    goToLocation: function(route) {      if(typeof this.q !== &amp;#39;undefined&amp;#39; &amp;amp;&amp;amp; typeof this.q === &amp;#39;string&amp;#39;) {        document.location.href=route+&amp;#39;/?query=&amp;#39;+this.q;      } else {        return;      }    },    // returns our search query (for example, &amp;quot;javascript tutorial&amp;quot;)    get: function() {      return this.q;    },    // &amp;quot;grab&amp;quot; the query from the query string in the URL and set this.q to it    setFromURL: function(name) {      name = name.replace(/[[]/, &amp;quot;[&amp;quot;).replace(/[]]/, &amp;quot;]&amp;quot;);      var regex = new RegExp(&amp;quot;[?&amp;amp;]&amp;quot; + name + &amp;quot;=([^&amp;amp;#]*)&amp;quot;),          results = regex.exec(location.search);      this.q = results === null ? &amp;quot;&amp;quot; : decodeURIComponent(results[1].replace(/+/g, &amp;quot; &amp;quot;));      return this;            },    // a wrapper for jQuery&amp;#39;s $.get    getJSON: function(file) {      return $.get(file);    }  };  // when we initialize a query, we have the option of giving it a query string  function Query(q) {    if(typeof q !== &amp;#39;undefined&amp;#39; &amp;amp;&amp;amp; typeof q === &amp;#39;string&amp;#39;) {      this.q = q;    }  }  // attach the Query object to the window  global.Query = Query;})(this,$);Whew! That’s a lot of stuff. Let’s write a little API documentation to show you what everything does:  var query = new Query() — we can create a new “container” to hold our search query  query.set(&#39;javascript tutorial&#39;) — this is what we want to search for, for example  query.goToLocation(&#39;my-search-page&#39;) — will bring us to /my-search-page?query=javascript%20tutorial  query.get() — returns `“javascript tutorial”, in this case  query.setFromURL() — when we reached /my-search-page?query=javascript%20tutorial, we can grab the “javascript tutorial” string, and set it (internally, it says this.q = &quot;javascript tutorial&quot;)  query.getJSON(&#39;/posts.json&#39;) — this just grabs our page, /posts.json and returns the return value of $.get (this is useful because we can call query.getJSON(&#39;/posts.json&#39;).done(function() {}))Still confused? I recommend reading up first on Immediately Invoked Function Expressions.Let the user search for something&amp;lt;!-- Your search form --&amp;gt;&amp;lt;form class=&amp;quot;search&amp;quot;&amp;gt; &amp;lt;input type=&amp;quot;text&amp;quot; class=&amp;quot;search-box&amp;quot; id=&amp;quot;search&amp;quot; /&amp;gt; &amp;lt;input type=&amp;quot;submit&amp;quot; class=&amp;quot;search-button&amp;quot; value=&amp;quot;Search&amp;quot; /&amp;gt;&amp;lt;/form&amp;gt;I hate forms. But here, we use them for a very specific reason. It’s so that we can execute our search function both whenever the user clicks the “Search” button, or whenever the user hits the “enter” key on the keyboard. HTML has this built-in functionality. If we didn’t use a form, and just used, say, a div, we would have to write code that would listen to both the click event on the button, and the keydown event on the text box.So on all pages where there is the above search form, we should also have this JavaScript:// search.js$(function(Query) {&amp;#39;use strict&amp;#39;;var query = new Query();$(&amp;#39;.search&amp;#39;).on(&amp;#39;submit&amp;#39;,exec);function submit(e) {// stop the form from doing its default behaviore.preventDefault();// set the query, and go to the search page with our query URLquery.set($(&amp;#39;.search-box&amp;#39;).val().trim()).goToLocation(&amp;#39;/search&amp;#39;);}}(Query));We could easily write the above code as such:// search.jsfunction submit(e) {e.preventDefault();document.location.href=&amp;#39;/search/?query=&amp;#39;+$(&amp;#39;.search-box&amp;#39;).val().trim();}However, the only reason we’re using our custom Query object is because it separates concerns, and we’ve also created a reusable, easy-to-read and understandable module.Finally, send the requestWe’ll have the following code on our /search page:// results.js$(function(Query,utils) {var query = new Query(),site = location.protocol + &amp;quot;//&amp;quot; + location.host,// some utility functionsutils = utils;query.setFromURL(&amp;#39;query&amp;#39;).getJSON(&amp;#39;/posts.json&amp;#39;).done(function(data) {console.log(data);// show our results});}(Query,utils));Remember my tip about JSONLint? Seriously, use it. Open up your console, and you should see your JSON (since we wrote console.log(data) in the above code). If you don&#39;t see it, your JSON might be improperly formatted.Wait, what’s utils?utils is a little package of a function that we’ll call shade. This function will be used to color our results based on the strength of the match against our query.// utils.js;(function(global) {&amp;#39;use strict&amp;#39;;var utils = {shade: shade};function shade(color,percent) {//Comes from: http://stackoverflow.com/a/13542669/2714730var f=parseInt(color.slice(1),16),t=percent&amp;lt;0?0:255,p=percent&amp;lt;0?percent*-1:percent,R=f&amp;gt;&amp;gt;16,G=f&amp;gt;&amp;gt;8&amp;amp;0x00FF,B=f&amp;amp;0x0000FF;return &amp;quot;#&amp;quot;+(0x1000000+(Math.round((t-R)*p)+R)*0x10000+(Math.round((t-G)*p)+G)*0x100+(Math.round((t-B)*p)+B)).toString(16).slice(1);}global.utils = utils;})(this);We’ve simply wrapped it in a module, because later on we could add more methods to module (if we wanted to). For example, a custom forEach function.Step 3 — Use lunr.js and display the resultsHere comes the fun part. First, here’s the HTML for our /search page:&amp;lt;!-- /search --&amp;gt;&amp;lt;div class=&amp;quot;search-results-count&amp;quot;&amp;gt;&amp;lt;/div&amp;gt;&amp;lt;ul class=&amp;quot;search-results&amp;quot;&amp;gt;&amp;lt;/ul&amp;gt;That’s literally it. Our JavaScript is a bit more interesting:// results.js.done(function(data) {var searchIndex,results,$resultsCount = $(&amp;#39;.search-results-count&amp;#39;),$results = $(&amp;#39;.search-results&amp;#39;),totalScore = 0,percentOfTotal;// PIECE 1// set up the allowable fieldssearchIndex = lunr(function() {this.field(&amp;#39;title&amp;#39;);this.field(&amp;#39;category&amp;#39;);this.field(&amp;#39;content&amp;#39;);this.ref(&amp;#39;url&amp;#39;);this.field(&amp;#39;date&amp;#39;);});// PIECE 2// add each item from posts.json to the index$.each(data,function(i,item) {searchIndex.add(item);});// PIECE 3// search for the query and store the results as an arrayresults = searchIndex.search(query.get());// PIECE 4// add the title of each post into each result, too (this doesn&amp;#39;t come standard with lunr.js)for(var result in results) {results[result].title = data.filter(function(post) {return post.url === results[result].ref;})[0].title;}// show how many results there were, in the DOM$resultsCount.append(results.length + (results.length === 1 ? &amp;#39; result&amp;#39; : &amp;#39; results&amp;#39;) + &amp;#39; for &amp;quot;&amp;#39; + query.get() +&amp;#39;&amp;quot;&amp;#39;);// PIECE 5// get the total score of all items, so that we can divide each result into it, giving us a percentage$.each(results, function(i, result) {totalScore+=result.score;});// PIECE 6 &amp;amp; PIECE 7// append each result link, with a border that corresponds to a color with a strength equal to its percentage// of the total score$.each(results, function(i,result) {percentOfTotal = result.score/totalScore;$results.append(&amp;#39;&amp;lt;li&amp;gt;&amp;lt;a href=&amp;quot;&amp;#39;+ site + result.ref +&amp;#39;&amp;quot;&amp;gt;&amp;#39;+result.title+&amp;#39;&amp;lt;/a&amp;gt;&amp;lt;/li&amp;gt;&amp;#39;);$results.children(&amp;#39;li&amp;#39;).last().css({&amp;#39;border-left&amp;#39;: &amp;#39;20px solid &amp;#39;+utils.shade(&amp;#39;#ffffff&amp;#39;,-percentOfTotal)});});});Let’s go over this in pieces:Piece 1We set up a searchIndex object, which is just an initialization of lunr. If you notice, we call this.field(), and every field actually exactly matches the fields that we have in our posts.json.Piece 2Then, we loop through our JSON objects from posts.json, and we add them to searchIndex.Piece 3We call .search(query.get()) on our lunr object, searchIndex. Remember, we called query.setFromURL(), so when we call query.get(), it returns the query string from the URLPiece 4It turns out that the results object only contains objects with a ref field. Open up your console and run your code and you’ll see what I mean. The ref field we set up to be the URL of the post. So all we’re gonna do is add the title of each post to the result object too, so that way later, we can add the a tags with the URLs and titles.Piece 5Each object also has a field called score, which lunr.js generates. This is a number between 0 and 1, which reflects the strength of the match. So if we have a match with a score of 0.09, and a match with a score of 0.0062, the one with 0.09 matched higher, based on lunr’s algorithm.Piece 6So, we’ll use a little bit of math. If we have two matches, result #1 at 0.09 and result #2 at 0.0062, the total is 0.0962, right? So result #1’s fraction of the total is result.score / totalScore, which is about 0.9355, and result #2’s is about 0.0644.Piece 7In comes our shade method. We’re gonna add a thick border to the side of each search result, and we’ll darken it by each result’s percentage. Thus, the higher strength of the match for a result, the darker the side border is, which shows the user, intuitively, that that specific match is “stronger”, since it has a “stronger” color. As a side note, when we loop through the elements and display them in a list with jQuery, the results are in order from highest score to lowest score by default (thanks to lunr.js), so the results are automatically ordered from high to low in your resulting HTML.ConclusionSo that’s it. We’ve successfully implemented a client-side only (or, mostly, since we use AJAX) search system.Benefits  We can use it on GitHub pages, or whatever hosting site you use that doesn’t support a backend with PHP, Node.js, etc.  Everything is written in JavaScript and HTML, so it’s relatively simple  We can render all the JSON ourselves (with Liquid and Jekyll), and serve it up statically  … It works.Drawbacks  Could be slow, depending on how many results you have. If you have a lot of results, you might want to consider using some loading icons or some sort of AJAX progress bar to show the progress of the loading so the user isn’t looking at a blank screen thinking nothing is happening. Also, you could display only a certain amount of results at a time, and wait to render to the second or third, etc., set of results until the user clicks a “next” button, or whatever.  JSON is finnicky. You have to render your JSON file with Liquid very detailed.  It’s a little bit hacky (using Liquid to make the JSON file)ExampleAs of the date of this post, I am using this on my website. Scroll down to the footer to utilize the search feature.CreditsThanks to christian-fei for the inspiration for the JSON creation via Liquid.Also, thanks Lunr.js!",
      "url"      : "/javascript/jekyll/tutorial/2015/03/26/getting-started-with-a-search-engine-for-your-site-no-server-required.html",
      "date"     : "2015-03-26 09:41:00 -0500"
    },
  
    {
      "title"    : "Tricks of the JavaScript for loop",
      "category" : "javascript",
      "content"	 : "I&#39;m sure you&#39;ve seen the common for loop written a thousand different ways. Well, in this post, you&#39;ll learn one readable way that is good for pretty much most instances where you&#39;ll use a for loop (some exceptions are noted, too). Oh, and scroll all the way down for a bonus snippet (we&#39;ll create something pretty cool, I think).We use the for loop generally to cycle through, say, an array of items. We can do something with each item. For example:var arr = [1,2,3,4,5];for(var i = 0; i &amp;lt; arr.length; i++) {console.log(arr[i]);}The code above obviously just increases i, starting at 0 and ending at the length of arr, which gives us the ability to access each of the items of arr by its index.How do you declare the loop?There’s frequently discussion on how to best write a for loop. There are some performance issues depending on how you write it (see this StackOverflow question), and I think a lot of it comes down to two things at the end: readability and personal style.Several ways:/*These will all ouput:12345*/var arr = [1,2,3,4,5];// #1for(var i = 0; i &amp;lt; arr.length; i++) {console.log(arr[i]);}// #2var i, len = arr.length;for(i = 0; i &amp;lt; len; i++) {console.log(arr[i]);}// #3var i = 0, len = arr.length;for(; i &amp;lt; len; i++) {console.log(arr[i]);}There are many other ways to write the loops, but those are some of the more common ones.Let’s go over all of them, briefly#1 — The problem with this one is that it might take some browsers longer because we’re “resetting” some variables each time (i.e., each iteration, the loop checks the section where we define the limit, which is oftentimes the length of an array). In fact, we can prove this:// #1var arr = [1,2,3,4,5];for(var i = 0; i &amp;lt; arr.length - i; i++) {console.log(arr[i]);}/*==&amp;gt; 1==&amp;gt; 2==&amp;gt; 3*/The engine appears to check each statement for every iteration of the loop. We can cache the variables, so in comes:#2 — This one caches the length, which could give you a little micro-optimized performance boost in some browsers. The first i definition doesn’t get “re-evaluated” at the end of each iteration. We can prove this too:// #2var i = 0, len = arr.length;for(i+=i; i &amp;lt; len; i++) {console.log(arr[i]);}/*==&amp;gt; 1==&amp;gt; 2==&amp;gt; 3==&amp;gt; 4==&amp;gt; 5*/As you can see above, i is only defined once. If it wasn’t, it would increase by itself each iteration, and we wouldn’t see every number of arr in the output. So it seems we’ve got to a nice, optimized way of writing the loop. But in comes the “personal style” element:#3 — I like the last one, because it defines everything at the top of the function, much like how I described as a best practice in my post about hoisting. You can see everything easier, and predict what is going to be used, and where. However, this is not the best style to use, if you need to re-define the length, or limit, every iteration (for instance, if you’re removing or adding items to an array). I think it also is very minimalistic and clean.// #3var i = 0, len = arr.length;for(; i &amp;lt; len; i++) {console.log(arr[i]);}Why does #3 not throw an error?The third one is strange, because we start it off with a ; all by its lonesome. Well, I think this can be explained if we accept that the second part of the loop, the i &amp;lt; // whatever part, looks to define itself by i, wherever i might be. The first part, the part where we normally declare and define i, it just that: a part where we can initialize variables. In fact, we could initialize any variables we wanted. We could even initialize the limit, or length variable, and the array itself! Check it out:for(var arr = [1,2,3,4,5], i = 0, len = arr.length; i &amp;lt; len; i++) {console.log(arr[i]);}Pretty cool, right? The initialization section of the loop provides us a space to intialize whatever we want; the syntactical benefit is that when a user looks at it, they know that i and len are directly tied to that loop. The downside I think, though, is that a beginner might be fooled into thinking that i only exists in the scope of the for loop, when in fact, even though i was initialized as part of the for loop, it still exists to whatever function scope that it’s inside. We can prove this:for(var arr = [1,2,3,4,5], i = 0, len = arr.length; i &amp;lt; len; i++) {console.log(arr[i]);}console.log(arr); // [1,2,3,4,5]console.log(i); // ==&amp;gt; 5console.log(len); // ==&amp;gt; 5Each of these sections (the first part where we initialize i, the second part, and the third part) all have names, by the way. They are called:for(/*initialization*/;/*condition*/;/*final-expression*/) {console.log(arr[i]);}So what have we learned?Well, we learned its easier when you call things by their names: initialization, condition, and final-expression.Initialization lessonsWe can use this to declare anything we want, but we don’t have to use it to declare anythingvar arr = [1,2,3,4,5], len = arr.length, i = 0;for(;i&amp;lt;len;i++) {console.log(arr[i]);}Additionally, although it may be a personal style issue, I think it’s best to declare everything at the top of the function where the for loop resides, unless you need to redefine something in the condition section, such as the length of an array.Condition lessonsWhen it comes to arrays, we’re probably better off caching the length of the array either in the initialization expression or at the top of the function in which the for loop resides. This can give some performance benefits. However, we want to keep in mind that in a function where we add or remove things from an array, we might need to redefine the condition expression of the for loop every iteration.Bonus!Let’s create a function that does a for loop for us. It eliminates the scoping issues of variables like i and len, and it feels a whole lot cleaner. In fact, this function is a simplified version of something that the Underscore.js and jQuery libraries do (jQuery has $.each). You can even see a very complicated polyfill for Array.prototype.forEach on MDN’s page. Here’s out simplified function:function forEach(arr,fn) {var i = 0, len = arr.length;if(arr.constructor === Array &amp;amp;&amp;amp; fn.constructor === Function) {for(;i&amp;lt;len;i++) {fn.call(arr,arr[i],i,arr);}}}// usage:var arr = [1,2,3,4,5];forEach(arr, function(element, index, array) {console.log(element);console.log(index);console.log(array);});/*==&amp;gt; 1==&amp;gt; 0==&amp;gt; [1,2,3,4,5]==&amp;gt; 2==&amp;gt; 1==&amp;gt; [1,2,3,4,5]==&amp;gt; 3==&amp;gt; 2==&amp;gt; [1,2,3,4,5]==&amp;gt; 4==&amp;gt; 3==&amp;gt; [1,2,3,4,5]==&amp;gt; 5==&amp;gt; 4==&amp;gt; [1,2,3,4,5]*/If you want to play around with that function, or just see if it works, open up your Developer Tools (cmd+opt+j on Mac in Chrome), copy and paste, hit enter, and voila.We could even put it in a module:;(function(win) {var utils = {forEach: forEach};function forEach(arr,fn) {var i = 0, len = arr.length;if(arr.constructor === Array &amp;amp;&amp;amp; fn.constructor === Function) {for(;i&amp;lt;len;i++) {fn.call(arr,arr[i],i,arr);}}}win.utils = utils;})(window);// usage:var myOtherModule = (function(utils) {var forEach = utils.forEach,arr = [1,2,3,4,5];forEach(arr,logEachElement);    /////function logEachElement(element,index,array) {console.log(element);console.log(index);console.log(array);}})(utils);Boom! Why all the strange semicolons? Why the weird function notation? Check out my post on weird semicolons and on a simple way to modularize dependencies for some answers to these question. Also, check out John Papa’s AngularJS style guide. It applies specifically to AngularJS, but a lot of the principles translate well into vanilla JavaScript principles.",
      "url"      : "/javascript/2015/03/24/tricks-of-the-javascript-for-loop.html",
      "date"     : "2015-03-24 17:18:00 -0500"
    },
  
    {
      "title"    : "How to show a summary of your post with Jekyll",
      "category" : "jekyll snippet",
      "content"	 : "In this little snippet, we&#39;re going to explore an option to show a summary of your blog post or article, if you&#39;re using the awesome static-site generator called Jekyll.I am using the static-site generator Jekyll to compile my website into a bunch of static files (the main benefit being a generally more secure and potentially quicker website due to a lack of server round-trips to a database).I ran across several solutions for displaying a summary or excerpt of the post in the main blog page (if you’re using the basic Jekyll theme that comes standard, it’ll probably be your index.html).Anyway, the solution I came up with is meant to allow me to control what part of the post I want to display as an excerpt. If I don’t choose a part of the post, that’s okay, it just displays a default excerpt.If you didn’t know, Jekyll uses Liquid for its templating.Example:&amp;lt;!-- index.html --&amp;gt;&amp;lt;p class=&amp;quot;post-excerpt&amp;quot;&amp;gt;{% if post.content contains &amp;#39;&amp;lt;!--excerpt.start--&amp;gt;&amp;#39; and post.content contains &amp;#39;&amp;lt;!--excerpt.end--&amp;gt;&amp;#39; %}{{ ((post.content | split:&amp;#39;&amp;lt;!--excerpt.start--&amp;gt;&amp;#39; | last) | split: &amp;#39;&amp;lt;!--excerpt.end--&amp;gt;&amp;#39; | first) | strip_html | truncatewords: 20 }}{% else %}{{ post.content | strip_html | truncatewords: 20 }}{% endif %}&amp;lt;/p&amp;gt;&amp;lt;!-- _posts/some-random-post.html --&amp;gt;&amp;lt;p&amp;gt;Here&amp;#39;s all my content, and &amp;lt;!--excerpt.start--&amp;gt;here&amp;#39;s where I want my summary to begin, and this is where I want it to end&amp;lt;!--excerpt.end--&amp;gt;.&amp;lt;/p&amp;gt;If I don’t add the comments in the post, the template with simply extract the content of the post, strip the HTML tags, and truncate it 20 words, followed by an ellipsis ....",
      "url"      : "/jekyll/snippet/2015/03/23/how-to-show-a-summary-of-your-post-with-jekyll.html",
      "date"     : "2015-03-23 04:50:00 -0500"
    },
  
    {
      "title"    : "Why do people add semicolons before modules?",
      "category" : "javascript snippet",
      "content"	 : "This post is going to discuss the reasoning behind a strange-looking syntax style that some people use when declaring JavaScript modules (in the context of immediately invoked function expressions). Simply put, the point of this trick is to get around minification issues when using other people&#39;s code (or your own).Simple answer: because of minification issues.Minification can cause modules to use each other as their arguments (unintentionally), if the developer isn’t careful.(function() {// code})()(function() {// code})();If you look closely enough at the above, you’ll see the first IIFE is missing a semicolon at the end.That means that when minified, it’ll look like this:The broken code:(function() {})()(function() {})();// (a)()(b)()The problem is that now function a is being called with function b passed in as an argument. Interesting.So, we just add a ; to the beginning of the module, and to the end. This acts as a safeguard to ensure we don’t run into that problem when we minify.So, when we try doing the above example with semicolons at the beginning and at the end, and you minify the code, you get this instead:The working code:;(function() {})();;(function() {})();The cool thing is, the above doesn’t throw any errors. In fact, JSHint won’t yell at you either.Why is this? Check out the MDN article on empty:  An empty statement is used to provide no statement, although the JavaScript syntax would expect one.So those extra semicolons are not a syntax error, because a random semicolon anywhere in the code can be interpreted as an empty statement. Cool, huh?",
      "url"      : "/javascript/snippet/2015/03/22/why-do-people-add-semicolons-before-modules.html",
      "date"     : "2015-03-22 18:34:00 -0500"
    },
  
    {
      "title"    : "Lightweight dependency modularization",
      "category" : "javascript",
      "content"	 : "So what&#39;s this post all about? We&#39;re going to examine an interesting alternative for passing dependencies between JavaScript modules. The goal is to avoid any overhead (by using libraries like RequireJS), but also to avoid attaching too many things to the global namespace...A common approachA common approach when utilizing the module pattern or something close to it, is to attach the end object to the window, or return the object inside some sort of local variable to create a namespace for your module.So you might end up having something like this:// first.module.js;(function(win) {var exports = //codewin.firstModule = exports;})(window);// several more modules...// and eventually a module that depends on firstModule// fifth.module.js;(function(win,firstModule) {// do something with firstModulevar exports = //code;win.fifthModule = exports;})(window,firstModule);&amp;lt;!-- then in your html... --&amp;gt;&amp;lt;script src=&amp;quot;first.module.js&amp;quot;&amp;gt;&amp;lt;/script&amp;gt;&amp;lt;!-- several other modules --&amp;gt;&amp;lt;scirpt src=&amp;quot;fifth.module.js&amp;quot;&amp;gt;&amp;lt;/script&amp;gt;Of course, the obvious problems with this are:  You attach a lot of stuff to the global scope (this can be overcome with various techniques, though)  You have to get the order of your &amp;lt;script&amp;gt; tags pretty exact (we’re pretending we’re not using a task runner here, like gulp)… and probably several other I’m forgetting about. There are other ways to do this (a popular library like RequireJS, for example), but in my case, I wanted to try to use a basic object that would be attached to the window, and have all of my dependencies attach to that global object.A global dependencies objectFor angular-state-manager, I utilized a global object called stateManagerDependencies, or something along that line, to attach all of my modules to that would eventually go into the main stateManager module.The purpose of this was to only have one object (the stateManagerDependencies object) be attached to the global scope (i.e. window object), and that would hold all of the dependencies, as opposed to attaching each dependency to the global scope at the end of each module.// dependencies.js;(function(win) {win.stateManagerDependencies = {};})(window);// first.example.module.js;(function(dependencies) {var dependencies = dependencies;// then, use them...})(stateManagerDependencies);// etc.Obvious downsides to this approach  You’re still attaching some strangely named global object to the window  In each module that depends on the dependencies object, there is no error-checking or method to list what modules are available inside the dependencies object (a possible fix for this is to simply implement some of those methods, for example: .list(), or .checkFor(), etc.)",
      "url"      : "/javascript/2015/03/22/lightweight-dependency-modularization.html",
      "date"     : "2015-03-22 16:00:00 -0500"
    },
  
    {
      "title"    : "How do I check if a parameter was passed in to a function in JavaScript?",
      "category" : "javascript",
      "content"	 : "This post is going to talk about checking for the &quot;existence&quot; of a parameter, if we expected one to be there and how to handle this &quot;flow of control&quot;, and how we define &quot;checking for existence&quot; in the first place. The fundamental concept behind all of this, as we&#39;ll learn, is the fuzzy idea of truthiness (which is different depending on which programming language you&#39;re referring too.) We&#39;ll see that JavaScript has a very broad idea of truthiness.What’s a parameter?A parameter can also be called an argument. It’s the thing passed into a function that you do something with:function test(x) {return x + 1;}test(1); // ==&amp;gt; returns 2var two = test(1); // this variable is now set to 2But what if a function can do something without a parameter, or what if the functionality changes based on whether or not a parameter was passed in?function test(x) {if(x) {// do something} else {// do something else}}In the above example, we expect that if x “exists”, then we’ll do something; if not, we’ll do something else. But checking for existence is a little more difficult than that. It has to do with truthiness.The truth about truthinessIn if statements, JavaScript evaluates the statement to a boolean true or false, and acts accordingly. But when certain values are encountered, JavaScript “coerces” them to a boolean value. For example, these statements are all correct:These are all true:/*1 == true0 == false&amp;#39; &amp;#39; == true&amp;#39;&amp;#39; == falsenull == falseundefined == false*/There are plenty of other examples. However, you’ll notice above that we’re using the == operator. This is called the equality operator. It checks if two values are “equal”, but to do this, JavaScript coerces the types.These are all incorrect (they will evaluate to false):/*1 === true0 === false&amp;#39; &amp;#39; === true&amp;#39;&amp;#39; === falsenull === falseundefined === false*/You’ll notice a very subtle, but important, difference here: we’re using the === operator: also called the identity operator. 1 does not have the identity of true, however, it is equal to true. This is confusing at first, but this is the principle of truthiness.This brings us to a very important logical operator, the exlamation point ! (also called the “not” operator). It gives you the opposite of whatever boolean value you give.The “not” operator in action (the following statements are all true)/*!1 === false!0 === true!&amp;#39; &amp;#39; === false!&amp;#39;&amp;#39; === true!null === true!undefined === true*/You’ll notice above that we are using the strict identity operator ===. This is okay, because the ! operator coerces the values on the left side of the equation to a boolean value. So really when we say !1 === false, we’re actually saying false === false. In other words, false does have the identity of false.The “double not” (or just two “not” operators — these are also all true)/*!!1 === true!!0 === false!!&amp;#39; &amp;#39; === true!!&amp;#39;&amp;#39; === false!!null === false!!undefined === false*/The double not basically coerces each value into its equal boolean form. That’s a weird way to say it. Think of it like this: 0 == false is the same as !!0 === false.So how do we check for existence?Well, it depends on how we want to define existence. Do we want to say that the parameter doesn’t exist, if it is null,undefined,0,false, or some other non-truthy value? What if we want to pass in an empty string (&#39;&#39;) as a value?Bad example:function test(x) {if(!!x) {console.log(&amp;#39;we passed the &amp;quot;if&amp;quot; test&amp;#39;);console.log(&amp;#39;empty strings are okay too&amp;#39;);}}test(null); // logs nothingtest(1); // ==&amp;gt; &amp;#39;we passed the &amp;quot;if&amp;quot; test&amp;#39;; &amp;#39;empty strings are okay too&amp;#39;test(&amp;#39;&amp;#39;); // logs nothing... uh oh// By the way, if(!!x) is basically shorthand for if(x == true)So we can combine instead combine logical statements to check for our idea of existence:Better example:function test(x) {if(!!x || x === &amp;#39;&amp;#39;) {console.log(&amp;#39;we passed the &amp;quot;if&amp;quot; test&amp;#39;);console.log(&amp;#39;empty strings are okay too&amp;#39;);}}test(null); // logs nothingtest(1); // ==&amp;gt; &amp;#39;we passed the &amp;quot;if&amp;quot; test&amp;#39;; &amp;#39;empty strings are okay too&amp;#39;test(&amp;#39;&amp;#39;); // ==&amp;gt; &amp;#39;we passed the &amp;quot;if&amp;quot; test&amp;#39;; &amp;#39;empty strings are okay too&amp;#39;// We could even use &amp;#39;typeof&amp;#39;function test(x) {if(!!x || typeof x === &amp;#39;string&amp;#39;) {console.log(&amp;#39;we passed the &amp;quot;if&amp;quot; test&amp;#39;);console.log(&amp;#39;empty strings are okay too&amp;#39;);}}// the above function will output the same thingChecking strictly for undefined values:function test() {if(a) {console.log(&amp;#39;a exists!&amp;#39;);}}// The above function will throw a ReferenceError: a is not definedfunction test() {if(typeof a !== &amp;#39;undefined&amp;#39;)  {console.log(&amp;#39;a exists!&amp;#39;);}}// This second function won&amp;#39;t log anything, but it also won&amp;#39;t throw an error!In the above example, a was never declared. If a variable is never declared and you try to check for its existence, you’ll get an error. But the typeof operator is the only operator (to my knowledge) that gets around this. If you check the type of a variable that was never declared, you won’t get an error, and your program can continue.Declared vs. definedvar a; // this is a declared variable that exists; its value is undefinedvar a = true; // this is now a defined variable; its value is NO LONGER undefinedvar b;console.log(typeof b); // ==&amp;gt; undefinedconsole.log(!!b); // ==&amp;gt; falsevar c;console.log(typeof c); // ==&amp;gt; undefinedconsole.log(!!c); // ==&amp;gt; ReferenceError! Your program is dead.Best PracticeI think in this circumstance, the best practice depends on however you define “existence” in the context of your specific function. This means that you have to take into consideration the concepts of truthiness, the use of the typeof operator, the principle of declared vs. defined, etc.Keep in mind, too, that there are many ways to check the types of of variables you encounter. For example:var x = [];// x.constructor === Array// typeof x === &amp;#39;object&amp;#39;// x.toString() === &amp;#39;&amp;#39;var y = &amp;#39;hello&amp;#39;;// y.constructor === String// typeof y === &amp;#39;string&amp;#39;// y.toString() === &amp;#39;hello&amp;#39;This is a topic for another post, but it demonstrates how you can check the types of a variable based on your definition of existence in the context of your specific function.",
      "url"      : "/javascript/2015/03/20/how-do-i-check-if-a-parameter-was-passed-in-to-a-javascript-function.html",
      "date"     : "2015-03-20 17:39:00 -0500"
    },
  
    {
      "title"    : "What is hoisting in JavaScript?",
      "category" : "javascript",
      "content"	 : "What is this strange word &quot;hoisting&quot;? As of the current version of JavaScript (ECMAScript5), there&#39;s not really such a thing as block scope, which is something common to lots of other programming languages (there is a caveat though, which we&#39;ll learn towards the end of this post.) Hoisting and the non-existence of &quot;block scope&quot; can be confusing. Learn how to overcome this issue.Hoisting is small concept that’s pretty importantHoisting is a concept that really defines a fundamental principle of JavaScript: there’s no such thing as block scope.What does that mean? Well, we know there’s a thing called function scope:Function scope example// This area out here is our &amp;quot;global scope&amp;quot;var globalVariable = [0,1,2,3];function testFunction() {//This area in here is our &amp;quot;function scope&amp;quot;// We can access variables from the global scopeconsole.log(globalVariable) // ==&amp;gt; [0,1,2,3]// &amp;quot;var&amp;quot; makes this variable only exists inside the functionvar hello = &amp;#39;hello&amp;#39;;// since there&amp;#39;s no &amp;quot;var&amp;quot; keyword,// we might as well have put this variable in the global scopeanotherVariable = &amp;#39;anotherVariable&amp;#39;; }console.log(hello) // ==&amp;gt; undefinedconsole.log(anotherVariable) // ==&amp;gt; &amp;#39;anotherVariable&amp;#39;… Easy.But how do we define block scope? In some other languages, it might be whatever is inside an if statement or a for loop. But that doesn’t exist in JavaScript (well, with a caveat, which we’ll go over in a later section):If-statement examplefunction testFunction(num) {if(num &amp;lt; 5) {console.log(&amp;#39;less than five&amp;#39;);} else {console.log(&amp;#39;greater than or equal to five&amp;#39;);}}testFunction(4); // ==&amp;gt; &amp;#39;less than five&amp;#39;The above example is super easy to understand. But let’s try and do something else with it.Trying to use block scope in JavaScriptfunction test() {if(/* something */) {var foo = &amp;#39;bar&amp;#39;;console.log(&amp;#39;foo&amp;#39;); // ==&amp;gt; &amp;#39;bar&amp;#39;}console.log(&amp;#39;foo&amp;#39;); // ==&amp;gt; &amp;#39;bar&amp;#39;}In the above example, if you didn’t know any better and you thought JavaScript had block scope, you might assume that the variable foo only exists inside the if block. But it doesn’t. In fact, even if the condition in the if statement evaluated to false, the variable foo would still exist to the entire function, but it just would not be set to &#39;bar&#39; (it would actually just remain undefined).So what’s hoisting then?Anything defined inside of a block is actually “hoisted” up to the function scope of whatever function you’re in.function test() {if(/* something */) {var foo;}}// it gets evaluated to something like this:function test() {var foo;if(/* something */) {// do something}}Anything you declare inside of a block (whether it’s a function, a string, an array, or whatever), it is available to the entire scope. Blocks simply evaluate those variable to whatever you say, when a certain condition is met.Best PracticeIn my opinion, declaring all variables that will, or even just might, be later defined within your function should happen at the top of the function. Some arguments against this might cite possible performance issues, but that might be going into the arguments of micro-optimization vs readability.  In my opinion, declaring all variables that will, or even just might, be later defined within your function should happen at the top of the functionI humbly assert this opinion because I think it helps immensely with code readability, especially with large, wordy functions, and understanding ahead of time what is going to happen and what certain variable might get new definitions.function someFunction() {var test, test1, test2, test3;if(/* something */) {test = 0;} else if (/* something */) {test1 = 0;} else if (/* something */) {test2 = 0;} else if (/* something */) {test3 = 0;}}In the above example, you know all the variables ahead of time, even though only one of them might actually be set to something else other than undefined (in this case, only one of those variables might be set to 0).To me, this looks like it could get confusing:function someFunction() {if(/* something */) {var test = 0;} else if (/* something */) {var test1 = 0;} else if (/* something */) {var test2 = 0;} else if (/* something */) {var test3 = 0;}}While this is a small, manufactured function that probably doesn’t make sense and probably does a whole lot of nothing, in a lengthier function, someone else who reads the code might see a new variable definition, and have trouble understanding the context or the use. Additionally, all those variable declarations will get hoisted to the top of the function anyway. You’ll still have three variables that are undefined, and only one that is set to 0, but the code just happens to be more confusing.Small caveat regarding letIf you use the keyword let in place of var, everything I just wrote in this blog post is null and void. let allows you to declare and/or define a block-scoped variable (see the MDN page, which says “The let statement declares a block scope local variable, optionally initializing it to a value.”)Note this warning on the MDN page as well:  The let block and let expression syntax is non-standard and will be removed in the future. Do not use them!",
      "url"      : "/javascript/2015/03/20/what-is-hoisting-in-javascript.html",
      "date"     : "2015-03-20 12:31:00 -0500"
    }
  
]